# MergeCells Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..MergeCells Method
TableSectionData Class See Also
---
Merges cells for the given area.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void MergeCells(
	TableMergedCell mergedCell
)
```

Visual Basic
---
```text
Public Sub MergeCells ( _
	mergedCell As TableMergedCell _
)
```

Visual C++
---
```text
public:
void MergeCells(
	TableMergedCell^ mergedCell
)
```

# ### Parameters
mergedCell
    Type: Autodesk.Revit.DB..::..TableMergedCell
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given TableMergedCell mergedCell is outside of acceptable range. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation is forbidden for cells in standard schedule body sections. |

# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace